// 1) მომხმარებელს შემოატანინეთ რიცხვი შემდეგ კი დაითვალეთ ერთიდან მომხმარებლსი შემოტანილ რიცხვამდე მხოლოდ ლუწი რიცხვების ჯამი
let num = Number(prompt("enter num"))
b = 0
c = 0
while(b != num){
    b += 1
    if(b % 2 == 0)
        c += b

}
console.log(c);


// 2) შექმენით სია სადაც იქნება 10 რენდომ რიცხვი, შემდეგ კი დაითვალეთ ამ სიის რიცხვების ჯამი
let mylist = [1, 3, 5, 2, 6, 4, 7]
b = 0
for(let i of mylist){
    b += i
}
console.log(b)
// 3) შექმენით რიცხვებით სავსე სია, შემდეგ მიწვდით თითოეულ ელემენტს და დააჯამეთ მხოლოდ ლუწი რიცხვები აყვანილი კვადრატში ამ სიიდან
let nums = [2, 6, 2, 1, 4, 2, 6, 7]
let g = 0
for(let num of nums){
    if(num % 2 == 0){
        g += num * num
    }
}
console.log(g)