# შექმენი ცვლადი my_number და მიაწერე რიცხვი 10. დაბეჭდე ცვლადის მნიშვნელობა.
my_number = 10
print(my_number)


# შექმენი ცვლადი my_text და მიაწერე მას ტექსტი "Hello, World!". დაბეჭდე ცვლადის ტიპი.
my_text = "hello, world!"
print(my_text)


# შექმენი ორი ცვლადი num1 და num2, და მიაწერე მათ 5 და 15. დაბეჭდე მათ ჯამი.
num1 = 5
num2 = 15
print(num1 + num2)


# შექმენი ორი ცვლადი first_name და last_name და მიაწერე მათ შესაბამისი სახელები. დაბეჭდე ორივე ერთად.
first_name = "tornike"
last_name = "khozrevanidze"
print(first_name + " " + last_name)


# შექმენი ცვლადი age და მიაწერე მას 8. შემდეგ შეცვალე მისი მნიშვნელობა 9-ზე და დაბეჭდე ახალი მნიშვნელობა.  
age = 8 
age = 9
print(age)


#  შექმენი ცვლადი, str_num და შეინახეთ “10”, მოცემული ცვლადი გადაიყვანეთ ინტეჯერში და შემდეგ გაამრავლეთ ექვსზე
str_num = "10"
print(int(str_num) * 6)

# შექმენი ცვლადები num1 და num2, ამ ცვლადებში შეინახეთ: “10” და “5”, შემდეგ გადაიყვანეთ ინტეჯერებში და გადაამრავლეთ
num1 = "10"
num2 = "5"
print(int(num1) * int(num2))


# შექმენით რამოდენიმე ცვლადი მინიმუმ 5 რომლებშიც შეინახავთ რიცხვებს შემდეგ კი დაბეჭდეთ მათი საშუალო არითმეტიკული.
num1 = 1
num2 = 2
num3 = 3
num4 = 4
num5 = 5
print((num1 + num2 + num3 + num4 + num5) / 5)
